0xsmirk/mcu_cmsis_svd/Spansion/MB9BF61xS.svd
        <!-- REGISTER "IRQ36MON" -->
        <register>
          <name>IRQ36MON</name>
          <description>IRQ36 Batch Read Register</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "USB1INT4" -->
            <field>
              <name>USB1INT4</name>
              <description>Endpoint 5 DRQ interrupt request on the USB ch.1 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB1INT3" -->
            <field>
              <name>USB1INT3</name>
              <description>Endpoint 4 DRQ interrupt request on the USB ch.1 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB1INT2" -->
            <field>
              <name>USB1INT2</name>
              <description>Endpoint 3 DRQ interrupt request on the USB ch.1 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB1INT1" -->
            <field>
              <name>USB1INT1</name>
              <description>Endpoint 2 DRQ interrupt request on the USB ch.1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB1INT0" -->
            <field>
              <name>USB1INT0</name>
              <description>Endpoint 1 DRQ interrupt request on the USB ch.1 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ37MON" -->
        <register>
          <name>IRQ37MON</name>
          <description>IRQ37 Batch Read Register</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "USB1INT5" -->
            <field>
              <name>USB1INT5</name>
              <description>"Status (SOFIRQ, CMPIRO) interrupt request on the USB ch.1 "</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB1INT4" -->
            <field>
              <name>USB1INT4</name>
              <description>"Status (DIRQ, URIRQ, RWKIRQ, CNNIRQ) interrupt request on the USB ch.1 "</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB1INT3" -->
            <field>
              <name>USB1INT3</name>
              <description>Status (SPK) interrupt request on the USB ch.1 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB1INT2" -->
            <field>
              <name>USB1INT2</name>
              <description>"Status (SUSP, SOF, BRST, CONF, WKUP) interrupt request on the USB ch.1 "</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB1INT1" -->
            <field>
              <name>USB1INT1</name>
              <description>Endpoint 0 DRQO interrupt request on the USB ch.1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB1INT0" -->
            <field>
              <name>USB1INT0</name>
              <description>Endpoint 0 DRQI interrupt request on the USB ch.1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ38MON" -->
        <register>
          <name>IRQ38MON</name>
          <description>IRQ38 Batch Read Register</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMAINT" -->
            <field>
              <name>DMAINT</name>
              <description>Interrupt request on DMA ch.0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ39MON" -->
        <register>
          <name>IRQ39MON</name>
          <description>IRQ39 Batch Read Register</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMAINT" -->
            <field>
              <name>DMAINT</name>
              <description>Interrupt request on DMA ch.1.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ40MON" -->
        <register>
          <name>IRQ40MON</name>
          <description>IRQ40 Batch Read Register</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMAINT" -->
            <field>
              <name>DMAINT</name>
              <description>Interrupt request on DMA ch.2.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
